## DNS
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 2 to add, 0 to change, 1 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_route53_record.design-alpha-canada-ca-A will be destroyed
  - resource "aws_route53_record" "design-alpha-canada-ca-A" {
      - fqdn    = "design.alpha.canada.ca" -> null
      - id      = "Z33C47YI9EN8XL_design.alpha.canada.ca_CNAME" -> null
      - name    = "design.alpha.canada.ca" -> null
      - records = [
          - "gallant-bassi-851d24.netlify.app",
        ] -> null
      - ttl     = 300 -> null
      - type    = "CNAME" -> null
      - zone_id = "Z33C47YI9EN8XL" -> null
    }

  # aws_route53_record.design-alpha-canada-ca-CNAME will be created
  + resource "aws_route53_record" "design-alpha-canada-ca-CNAME" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "design.alpha.canada.ca"
      + records         = [
          + "gallant-bassi-851d24.netlify.app",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z33C47YI9EN8XL"
    }

  # aws_route53_record.design-alpha-canada-ca-TXT will be created
  + resource "aws_route53_record" "design-alpha-canada-ca-TXT" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "design.alpha.canada.ca"
      + records         = [
          + "91447",
        ]
      + ttl             = 300
      + type            = "TXT"
      + zone_id         = "Z33C47YI9EN8XL"
    }

Plan: 2 to add, 0 to change, 1 to destroy.

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"


```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.alpha-canada-ca-public"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.cds-snc-ca-public"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.notification-canada-ca-public"]

19 tests, 16 passed, 3 warnings, 0 failures, 0 exceptions

```

</details>
